<template>
  <div>
    <Title title='新規登録' :showBackBtn="false"></Title>
    <div class="main">
      <div class="field">
        <label class='label'>ニックネーム</label>
        <input type="text" placeholder=" " v-model="name" />
      </div>
      <div class="field">
        <label class='label'>メールアドレス</label>
        <input type="text" placeholder=" " v-model="email" />
      </div>
      <div class="field">
        <label class='label'>パスワード</label>
        <input type="password" placeholder=" " v-model="password" />
      </div>
      <div class="field2">
      <label class="label">ユーザー区分</label>
        <div>
          <input type="radio" id="guest" value="guest" name='kind' v-model="kind" checked>
          <label for="guest">個人ユーザー</label>
        </div>
        <div>
          <input type="radio" id="owner" value="owner" name='kind' v-model="kind" >
          <label for="owner">事業者</label>
        </div>
      </div>
      <label class="label">利用規約</label>
      <div class="rule">
        1. 定義

本規約では、以下の用語を使用します。 
1.1. 「コンテンツ」とは、文章、音声、音楽、画像、動画、ソフトウェア、プログラム、コードその他の情報のことをいいます。 
1.2. 「本コンテンツ」とは、本サービスを通じてアクセスすることができるコンテンツのことをいいます。 
1.3. 「投稿コンテンツ」とは、お客様が本サービスに投稿、送信、アップロードしたコンテンツのことをいいます。 
1.4. 「コイン」とは、本サービスにおいて有償で提供されるサービスまたはコンテンツと交換可能な前払式支払手段およびこれに類するもののことをいいます。
1.5. 「個別利用条件」とは、本サービスに関して、本規約とは別に「規約」、「ガイドライン」、「ポリシー」等の名称で当社が配布または掲示している条件のことをいいます。

2. 規約への同意

2.1. お客様は、本規約の定めに従って本サービスを利用しなければなりません。お客様は、本規約に同意をしない限り本サービスを利用できません。
2.2. お客様が未成年者である場合は、親権者等の法定代理人の同意を得たうえで本サービスを利用してください。また、お客様が本サービスを事業者のために利用する場合は、当該事業者も本規約に同意したうえで本サービスを利用してください。 
2.3. 本サービスにおいて個別利用条件がある場合、お客様は、本規約のほか個別利用条件の定めにも従って本サービスを利用しなければなりません。

3. 規約の変更

当社は、当社が必要と判断する場合、本サービスの目的の範囲内で、本規約を変更することができます。その場合、当社は、変更後の本規約の内容および効力発生日を、本サービスもしくは当社ウェブサイトに表示し、または当社が定める方法によりお客様に通知することでお客様に周知します。変更後の本規約は、効力発生日から効力を生じるものとします。

4. アカウント

4.1. 本サービスの利用に際して、情報を登録のうえ、アカウントの作成が必要となる場合があります。この場合、お客様は、真実、正確かつ完全な情報を登録しなければならず、常に最新の情報となるよう修正しなければなりません。
4.2. お客様は、本サービスの利用に際して認証情報を登録する場合、これを不正に利用されないようご自身の責任で厳重に管理しなければなりません。当社は、登録された認証情報を利用して行われた一切の行為を、お客様ご本人の行為とみなすことができます。
4.3. 本サービスに登録したお客様は、いつでもアカウントを削除して退会することができます。
4.4. 当社は、最終のアクセスから１年間以上経過しているアカウントを、あらかじめお客様に通知することなく削除することができます。
4.5. お客様の本サービスにおけるすべての利用権は、理由を問わず、アカウントが削除された時点で消滅します。お客様が誤ってアカウントを削除した場合であっても、アカウントの復旧はできませんのでご注意ください。
4.6. 本サービスのアカウントは、お客様に一身専属的に帰属します。お客様の本サービスにおけるすべての利用権は、第三者に譲渡、貸与その他の処分または相続させることはできません。

5. プライバシー

5.1. 当社は、お客様のプライバシーを尊重しています。
5.2. 当社は、お客様のプライバシー情報と個人情報を、LINE プライバシーポリシーに従って適切に取り扱います。
5.3. 当社は、お客様から収集した情報を安全に管理するため、セキュリティに最大限の注意を払っています。

6. サービスの提供

6.1. お客様は、本サービスを利用するにあたり、必要なパーソナルコンピュータ、携帯電話機、スマートフォンその他の通信機器、オペレーションシステム、通信手段および電力等を、お客様の費用と責任で用意しなければなりません。
6.2. 当社は、本サービスの全部または一部を、年齢、本人確認の有無、登録情報の有無、その他、当社が必要と判断する条件を満たしたお客様に限定して提供することができます。
6.3. 当社は、当社が必要と判断する場合、あらかじめお客様に通知することなく、いつでも、本サービスの全部または一部の内容を変更することができます。
6.4. 当社は、以下のいずれかに該当する場合、あらかじめお客様に通知することなく、本サービスの全部または一部の提供を中止することができます。
(1) システムのメンテナンスまたは修理の実施を行う場合
(2) 火災・停電等の事故、天災、戦争、暴動、労働争議等の不可抗力により、本サービスの提供ができなくなった場合
(3) システムの障害が発生した場合またはシステムに負荷が集中した場合
(4) お客様または第三者の安全を確保する場合または公共の利益のために緊急を要する場合
(5) (1)から(4)までに定めるもののほか、当社が必要と合理的に判断した場合

7. 緊急通報機能の非提供

本サービスは、警察機関、海上保安機関、消防機関その他の機関への緊急通報手段を提供するものではありません。

8. 広告表示

当社は、本サービスに当社または第三者の広告を掲載することができます。

9. 当社以外の第三者のサービス

本サービスは、当社以外の第三者が提供するサービスまたはコンテンツを含む場合があります。かかるサービスまたはコンテンツに対する責任は、これを提供する第三者が負います。また、かかるサービスまたはコンテンツには、これを提供する第三者が定める利用規約その他の条件が適用されることがあります。

10. コンテンツ

10.1. 当社は、当社が提供する本コンテンツについて、お客様に対し、譲渡および再許諾できず、非独占的な、本サービスの利用を唯一の目的とする利用権を付与します。
10.2. お客様は、利用料、利用期間その他の利用条件が別途定められた本コンテンツを利用する場合、かかる利用条件に従うものとします。本サービスの画面上で「購入」、「販売」等の表示がされている場合であっても、当社がお客様に対し提供する本コンテンツに関する知的財産権その他の権利はお客様に移転せず、お客様には、上記の利用権のみが付与されます。
10.3. お客様は、本コンテンツを、本サービスが予定している利用態様を超えて利用(複製、送信、転載、改変を含みます。)してはなりません。
10.4. 投稿コンテンツのバックアップは、お客様ご自身で行っていただくこととなります。当社は投稿コンテンツのバックアップを行う義務を負いません。
10.5. 本サービスは、複数のお客様が投稿、修正、削除等の編集を行える機能を含む場合があります。この場合、お客様はご自身の投稿コンテンツに対する他のお客様の編集を許諾するものとします。
10.6. お客様は、投稿コンテンツに対して有する権利を従前どおり保持し、当社がかかる権利を取得することはありません。ただし、投稿コンテンツのうち、友だち関係にない他のお客様一般にも公開されたものに限り、お客様は、当社に対し、これをサービスやプロモーションに利用する権利（当社が必要かつ適正とみなす範囲で省略等の変更を加える権利を含みます。また、かかる利用権を当社と提携する第三者に再許諾する権利を含みます。）を許諾したこととなります。
10.7. お客様は、投稿コンテンツに関する著作者人格権等の権利を、10.5.および10.6.に基づく当社または第三者による利用に対して行使しないものとします。
10.8. 当社は、法令または本規約の遵守状況等を確認する必要がある場合、法令に反しない限り、お客様の投稿コンテンツの内容を確認することができます。ただし、当社はそのような確認を行う義務を負うものではありません。
10.9. 当社は、お客様が投稿コンテンツに関し法令もしくは本規約に違反し、または違反するおそれがあると認めた場合、その他業務上合理的な必要がある場合、あらかじめお客様に通知することなく、投稿コンテンツを削除する等の方法により、本サービスの利用を制限できます。

      </div>

      <div class="agree">
        <input id='rule' type="checkbox" v-model="agree">
        <label for='rule'>利用規約に同意します</label>
      </div>
      <div class='btn' @click='create'>
        登録する
      </div>

    </div>
  </div>
</template>

<script>
import Title from '../components/Title.vue'

export default {
  name: 'Signup',
  components: {Title},
  data() {
    return {
      name: "",
      email: "",
      password: "",
      kind: 'guest',
      agree: false,
    };
  },
  methods: {
    create() {
      if(!this.agree) {
        alert("利用規約に同意してください")
        return;
      }

      if(!this.name || !this.email || !this.password) {
        alert("未入力の項目があります")
        return;
      }

      const _this = this
      this.$firebase.auth()
        .createUserWithEmailAndPassword(this.email, this.password)
        .then( result => {
          _this.$firebase.firestore().collection('users')
            .doc(result.user.uid)
            .set({
              id: result.user.uid,
              name: _this.name,
              icon: 'https://firebasestorage.googleapis.com/v0/b/social-creators-b.appspot.com/o/userIcon%2Fdefault.png?alt=media&token=03423779-f433-4d38-85d6-d5c1e96cc81e',
              kind: _this.kind,
              count: 0
            })
            .then( async () => {
              if (_this.kind === 'owner') {
                await this.$firebase.firestore().collection('stores')
                  .doc(result.user.uid)
                  .set({
                    id: result.user.uid,
                    createdAt: _this.getFireTime()
                  })
              }
              _this.$router.push('\mypage')
            })
        })
        .catch( err => {
          alert('エラーが発生しました', err)
        });
    }
  }
}
</script>

<style lang='scss' scoped>
.main {
  padding: 20px;
}

.label {
  display: block;
  margin-top: 20px;
}
.field {
  input {
    border-radius: 40px;
    outline: none;
    border: black solid 1px;
    margin-left: 20px;
    width: 280px;
    padding-left: 20px;
  }
}

.field2 {
  margin-top: 20px;
}

.btn {
  cursor: pointer;
  width: 200px;
  background-color: var(--yellow);
  text-align: center;
  margin: 0 auto;
  padding: 4px 8px;
  color: white;
  border-radius: 10px;
  margin-top: 20px;
}

.rule {
  margin: 0 auto;
  width: 80%;
  height: 200px;
  overflow-y: scroll;
  padding: 20px;
  border: gray solid 1px;
  font-size: 6px;
  margin-top: 10px;
  border-radius: 10px;
}

.agree {
  margin: 10px;
  text-align: center;
}

</style>