<template>
  <div>
    <Title title="" showBackBtn="true"></Title>
    <div class="main">
      <div class="title">
        モダン焼への愛情
      </div>
      <div class="date">
        2020/8/25 9:19
      </div>
      <div class="body">
        {{ body }}
      </div>
    </div>
  </div>
</template>

<script>
import Title from '../components/Title.vue'

export default {
  name: 'Story',
  components: {Title},
  data() {
    return {
      body: `
      「僕の家は昔、そんなに裕福ではなくて、普段はお好み焼きだったんだよね。」
父親が事業を営んでいた家庭に生まれたあらかわさん。
昔を懐かしそうに、少し斜め上を見上げながら語り始めた。

少しずつ景気も回復してきた頃、初めて家族みんなで外で
お好み焼きを食べに行った時、
お好み焼きと並列でモダン焼きの文字を目にしたという。

目新しさに惹かれてモダン焼きを注文。
初めて口にしたモダン焼きに衝撃を受けた。
お好み焼きのボリューム感はそのままに、麺がもちもちしていた。
しばらく鉄板の上に置いていると、その麺がカリカリっとし始める。
鉄板を存分に生かした食べ物だと思った。

その後家でお好み焼きを作る時に、母にモダン焼きにしてもらうように
頼み込んで焼いてもらったのだが、これがどうしてもあの時お店で食べた
モダン焼きには程遠かった。

家とお店とで何が違うのか。
それは鉄板だった。

「これはいける」
確信したあらかわさんはお好み焼き屋でバイトをしながら、
日夜より美味しい鉄板焼きの開発に勤しんだ。

鉄板で食べるからこそのうまさがモダン焼きにはある。
だから、モダン焼きは家で作る家庭の味ではなく、
ちょっとした特別な日に外で食べる晴れの味になるんだ。

21歳の時に自分の店を持つ決心んをして、開いたのが
日本初のモダン焼き専門店「モダン焼きフジ」だ。
以来30年、今度は世界に通用するモダン焼きにするため、
改良に改良を重ねているという。

「モダン焼きには完成なんてない。
だからこの先もきっと新しいおいしさを追い求め続けるんだろうね。大変だよ」

世界への挑戦者あらかわさんは、誇らしそうな顔をしていた。`
    }
  }
}
</script>

<style lang='scss' scoped>
.main {
  padding: 20px;

  .title {
    border-bottom: black solid 1px;
    font-size: 20px;
  }

  .date {
    text-align: right;
    font-size: 13px;
  }

  .body {
    white-space: pre-line;
  }
}
</style>